// 9. Вывести на экран чётные числа от 1 до N

int i=2;
int N;
N=Convert.ToInt32(Console.ReadLine());
// нц пока i<=N

while(i<=N)
{
    System.Console.WriteLine(i);
    i=i+2;
}

//кц
